In [1]:
import pandas as pd
import numpy as np

In [21]:
city = pd.read_excel('/Ch02/Practice Files/Citydata.xlsx',
                     skiprows=4, usecols=range(2, 5), index_col=0)

Расстояние между любыми двумя городами США (за исключением городов на Аляске и Гавайях) можно приблизительно вычислить по следующей формуле: $$69 \sqrt{(lat_{1} - lat_{2})^2 + (long_{1} - long_{2})^2}$$

Создайте таблицу, определяющую расстояние между любыми двумя городами из этого списка.

In [72]:
def distance(cit_1: str, cit_2: str) -> int:
    lat_1, long_1 = city.loc[cit_1].values
    lat_2, long_2 = city.loc[cit_2].values
    return int(69 * np.sqrt((lat_1 - lat_2) ** 2 + (long_1 - long_2) ** 2))

In [154]:
d = np.zeros((len(city), len(city)))
for i, city_1 in enumerate(city.index):
    for j, city_2 in enumerate(city.index):
        d[i,j] = distance(city_1, city_2)

In [160]:
distances = pd.DataFrame(d.astype(int), index=city.index, columns=city.index)

Таблица расстояний между городами

In [161]:
distances

,New York,Boston,Philadelphia,Charlotte,Atlanta,New Orleans,Miami,Dallas,Houston,Chicago,...,Cleveland,Indy,Denver,Minneapolis,Phoenix,Salt Lake City,LA,SF,SD,Seattle
New York,0,228,95,608,866,1328,1116,1671,1663,955,...,541,844,2139,1371,2682,2622,3104,3366,3030,3347
Boston,228,0,324,835,1094,1555,1303,1897,1891,1152,...,740,1056,2345,1549,2900,2823,3319,3573,3247,3546
Philadelphia,95,324,0,514,771,1232,1041,1577,1567,878,...,467,759,2056,1302,2592,2539,3015,3281,2940,3265
Charlotte,608,835,514,0,266,723,649,1116,1074,658,...,439,484,1692,1095,2162,2180,2595,2889,2510,2904
Atlanta,866,1094,771,266,0,461,623,858,807,597,...,563,430,1473,987,1911,1958,2346,2650,2257,2676
New Orleans,1328,1555,1232,723,461,0,729,513,379,828,...,974,725,1236,1061,1550,1691,1986,2319,1886,2381
Miami,1116,1303,1041,649,623,729,0,1243,1084,1219,...,1088,1048,1959,1603,2264,2419,2697,3040,2591,3109
Dallas,1671,1897,1577,1116,858,513,1243,0,228,883,...,1202,882,738,875,1056,1179,1493,1813,1400,1867
Houston,1663,1891,1567,1074,807,379,1084,228,0,983,...,1243,942,951,1058,1180,1368,1614,1956,1511,2033
Chicago,955,1152,878,658,597,828,1219,883,983,0,...,414,176,1194,445,1778,1671,2183,2423,2121,2394
Detroit,645,834,576,521,600,975,1162,1154,1214,320,...,114,273,1514,726,2093,1990,2502,2743,2437,2712
Cleveland,541,740,467,439,563,974,1088,1202,1243,414,...,0,325,1605,836,2169,2084,2583,2833,2515,2808
Indy,844,1056,759,484,430,725,1048,882,942,176,...,325,0,1297,612,1845,1781,2263,2522,2192,2507
Denver,2139,2345,2056,1692,1473,1236,1959,738,951,1194,...,1605,1297,0,877,660,487,1011,1229,970,1213
Minneapolis,1371,1549,1302,1095,987,1061,1603,875,1058,445,...,836,612,877,0,1520,1315,1888,2081,1845,2021
Phoenix,2682,2900,2592,2162,1911,1550,2264,1056,1180,1778,...,2169,1845,660,1520,0,503,436,782,348,904
Salt Lake City,2622,2823,2539,2180,1958,1691,2419,1179,1368,1671,...,2084,1781,487,1315,503,0,644,766,658,726
LA,3104,3319,3015,2595,2346,1986,2697,1493,1614,2183,...,2583,2263,1011,1888,436,644,0,386,126,586
SF,3366,3573,3281,2889,2650,2319,3040,1813,1956,2423,...,2833,2522,1229,2081,782,766,386,0,512,262
SD,3030,3247,2940,2510,2257,1886,2591,1400,1511,2121,...,2515,2192,970,1845,348,658,126,512,0,708
Seattle,3347,3546,3265,2904,2676,2381,3109,1867,2033,2394,...,2808,2507,1213,2021,904,726,586,262,708,0

1. С помощью функции ИНДЕКС определите расстояние между Лос-Анджелесом и Финиксом, а также расстояние между Денвером и Майами.

In [162]:
distance('LA', 'Phoenix'), distance('Denver', 'Miami')

(436, 1959)

2. С помощью функции ИНДЕКС вычислите суммарное расстояние от Далласа до других городов.

In [206]:
distances['Dallas'].sum(axis=0)

23645

3. Жительница Далласа, штат Техас, отправляется в путешествие на машине в Чикаго, Денвер, Лос-Анджелес, Финикс и Сиэтл. Сколько миль ей предстоит проехать?

In [169]:
rout = ['Dallas', 'Chicago', 'Denver', 'LA', 'Phoenix', 'Seattle']

In [175]:
full_distance = 0
for pair in list(zip(rout, rout[1:])):
    full_distance += distances.loc[pair[0], pair[1]] #distance(*pair)
full_distance

4428

В файле Grades.xlsx содержатся экзаменационные баллы студентов. Шкала соотношения баллов и оценок приведена в таблице.

| Баллы | Оценка |
| :- | :-: |
| Ниже 60 | F |
| 60—69 | D |
| 70—69 | C |
| 80—89 | B |
| 90 и выше | A |

Используйте формулу для определения буквенной оценки каждого студента на этом экзамене.

In [36]:
grades = pd.read_excel('/Ch02/Practice Files/grades.xlsx',
                     skiprows=5, usecols=range(3, 5))

In [47]:
grades['Grade'] = pd.cut(grades.Score, bins=[-np.inf, 60, 69, 79, 89, np.inf], labels=list('FDCBA'))

In [48]:
grades

     Score Grade
0       63     D
1       40     F
2       44     F
3       74     C
4       99     A
..     ...   ...
108     55     F
109     41     F
110     59     F
111     66     D
112     69     D

[113 rows x 2 columns]

В файле Employees.xlsx содержится рейтинг (по шкале от 0 до 10), присвоенный каждым из 35 сотрудников трем заданиям. В файле также указаны задания, назначенные каждому сотруднику. С помощью формулы определите рейтинг, который каждый сотрудник присвоил назначенному ему заданию

In [53]:
employees = pd.read_excel('/Ch02/Practice Files/employees.xlsx',
                          skiprows=4,
                          usecols=range(1, 7),
                          index_col=2)

In [68]:
employees['Rank'] = employees.apply(lambda df: df[df['Assigned to'].astype(int)].astype(int), axis=1)

In [69]:
employees

        Rank  Assigned to   1   2   3
Worker
1          5            2   4   5   4
2          1            2   1   1   6
3          9            2   8   9   2
4          3            1   3   1   5
5          7            2   9   7   8
6          8            2   3   8   6
7          5            3   5   4   5
8          9            2   5   9   5
9          1            2   3   1  10
10         3            1   3   6   6
11         1            1   1   2   1
12         2            1   2   1   9
13         7            1   7   8   4
14         7            1   7   5   5
15         3            3   9   1   3
16         5            1   5  10   8
17         5            2  10   5   3
18         1            2   4   1   5
19         4            3   0   1   4
20         1            3   5   1   1
21         2            2  10   2   3
22         8            2   6   8   6
23         9            2  10   9   9
24         8            1   8   3   3
25         3            2   4   3   7
26         4            3   3   1   4
27         0            1   0   4   0
28         5            2   4   5   9
29         8            3  10   6   8
30         6            3   3   0   6
31         3            2   9   3   8
32         5            1   5   2   6
33         6            3   1   0   6
34         4            3   3  10   4
35         2            2   3   2   5

В файле Nbadistances.xlsx показаны расстояния между любой парой спортивных арен НБА. Предположим, что находясь в Атланте, необходимо посетить арены в указанном порядке и затем вернуться в Атланту. Насколько длинным окажется путешествие?

In [197]:
Nbadistances = pd.read_excel('/Ch03/Practice Files/Nbadistances.xlsx',
                              usecols=range(2,33), index_col=0)

In [202]:
Nbadistances

,Atlanta,Boston,Charlotte,Chicago,Cleveland,Dallas,Denver,Detroit,Golden State,Houston,...,Orlando,Philadelphia,Phoenix,Portland,Sacramento,San Antonio,Seattle,Toronto,Utah,Washington
Atlanta,0.0000,936.6688,226.7853,588.1757,553.8188,721.5437,1218.0933,608.3514,2128.7805,701.4528,...,401.4298,663.3482,1591.6684,2172.3091,2086.1141,882.4412,2181.5838,735.9878,1583.1442,541.7573
Boston,936.6688,0.0000,720.6751,852.9186,550.5893,1552.1614,1774.1155,629.2696,2689.0357,1605.2071,...,1114.9356,273.5642,2299.8683,2539.3973,2631.0563,1766.9534,2492.2631,431.3524,2098.7672,394.9290
Charlotte,226.7853,720.6751,0.0000,588.6458,434.1983,930.9528,1364.3885,522.1530,2291.0725,926.7392,...,462.5219,447.6411,1782.5392,2289.5077,2244.4277,1105.4190,2285.2923,588.1744,1727.2478,328.3485
Chicago,588.1757,852.9186,588.6458,0.0000,310.7750,803.3595,922.6840,224.9533,1846.4435,939.4358,...,985.6322,667.9844,1452.0514,1756.8598,1790.9991,1050.5431,1735.3692,439.0717,1258.0651,597.4263
Cleveland,553.8188,550.5893,434.1983,310.7750,0.0000,1026.2374,1232.1416,113.1587,2157.2178,1113.7954,...,893.3922,359.1523,1749.3791,2055.5284,2101.7189,1257.0025,2026.4251,191.3496,1568.7309,304.5719
Dallas,721.5437,1552.1614,930.9528,803.3595,1026.2374,0.0000,668.6480,995.3916,1472.1182,224.7778,...,963.2098,1298.8491,885.6090,1632.7538,1439.8514,251.5540,1680.6166,1205.7027,999.1334,1184.3888
Denver,1218.0933,1774.1155,1364.3885,922.6840,1232.1416,668.6480,0.0000,1144.8941,933.2864,884.6065,...,1557.5185,1583.7181,584.3414,976.3049,882.8597,807.0737,1014.2248,1349.9264,365.0766,1498.2042
Detroit,608.3514,629.2696,522.1530,224.9533,113.1587,995.3916,1144.8941,0.0000,2063.6308,1104.4521,...,971.9149,464.4448,1676.8205,1948.4622,2006.9096,1234.9548,1916.9430,216.7456,1473.8677,417.3337
Golden State,2128.7805,2689.0357,2291.0725,1846.4435,2157.2178,1472.1182,933.2864,2063.6308,0.0000,1634.5366,...,2430.6930,2512.6328,643.9213,534.9639,68.1920,1479.0023,677.6888,2258.9598,590.2752,2430.3360
Houston,701.4528,1605.2071,926.7392,939.4358,1113.7954,224.7778,884.6065,1104.4521,1634.5366,0.0000,...,849.1169,1338.9231,1016.2445,1835.5434,1608.5232,189.7920,1890.4460,1302.2439,1199.7346,1218.9111
Indiana,425.8436,807.4155,427.6220,166.0376,263.4581,764.4281,1006.2127,240.0075,1938.8731,864.8429,...,820.6966,583.9572,1499.0749,1885.6372,1886.6107,999.2512,1872.2829,442.0191,1356.9891,492.2078
LA Clippers,1937.7604,2597.8344,2120.9409,1744.9172,2050.9069,1240.8457,828.7812,1969.0477,339.7860,1374.9023,...,2202.9235,2394.6754,358.7708,825.7349,361.1549,1204.7109,958.8934,2177.0292,580.6454,2300.6750
LA Lakers,1937.7604,2597.8344,2120.9409,1744.9172,2050.9069,1240.8457,828.7812,1969.0477,339.7860,1374.9023,...,2202.9235,2394.6754,358.7708,825.7349,361.1549,1204.7109,958.8934,2177.0292,580.6454,2300.6750
Memphis,337.0009,1136.2742,520.8569,481.2537,629.9248,421.2610,885.2956,623.1363,1791.7840,484.0823,...,683.5708,878.8182,1262.7020,1849.0544,1749.3061,632.0468,1866.3223,818.1737,1249.8199,763.4048
Miami,604.6080,1255.4831,652.5091,1189.0838,1086.5125,1111.5530,1732.4196,1169.4713,2583.6233,968.1184,...,203.5529,1015.6883,1981.6249,2707.6360,2551.1095,1149.1887,2733.4575,1235.2154,2088.8881,922.0094
Milwaukee,667.7905,857.4527,658.0555,80.7875,336.0430,857.5335,918.8169,232.6147,1832.4022,1004.2691,...,1063.9745,694.5564,1464.3278,1719.5795,1775.2128,1107.1582,1692.1396,431.1265,1242.3345,635.8098
Minnesota,907.3958,1123.8439,939.0799,353.6410,631.5202,862.9648,702.0942,522.3896,1574.7426,1055.8800,...,1308.7176,986.6998,1279.6212,1426.7299,1514.3820,1110.1514,1394.9213,692.8361,986.7377,933.9271
New Jersey,747.2211,189.6133,532.9704,708.6064,398.0474,1370.9422,1630.0492,493.9236,2554.8764,1417.6464,...,942.6830,85.5789,2139.4744,2437.3723,2498.9971,1581.5206,2399.9458,334.8507,1965.9085,205.6770
New Orleans,424.4786,1359.1711,649.4822,833.1469,923.7976,443.0588,1087.4977,944.1952,1914.5061,317.7427,...,534.0803,1086.4958,1315.4011,2062.3026,1882.8407,507.4189,2100.5575,1114.7983,1433.6909,964.7731
New York,748.1971,188.4763,532.9826,715.3746,404.7221,1374.7770,1636.5827,501.2016,2561.7241,1420.2469,...,940.1624,85.3486,2145.1066,2445.0983,2505.9222,1584.6301,2407.8465,343.0864,1972.8437,206.4528
Orlando,401.4298,1114.9356,462.5219,985.6322,893.3922,963.2098,1557.5185,971.9149,2430.6930,849.1169,...,0.0000,859.6945,1845.8577,2529.1158,2394.8246,1037.2100,2549.5401,1050.3194,1918.1523,755.9546
Philadelphia,663.3482,273.5642,447.6411,667.9844,359.1523,1298.8491,1583.7181,464.4448,2512.6328,1338.9231,...,859.6945,0.0000,2081.8398,2412.8864,2458.0298,1505.1714,2380.5737,339.7985,1925.4344,121.7231
Phoenix,1591.6684,2299.8683,1782.5392,1452.0514,1749.3791,885.6090,584.3414,1676.8205,643.9213,1016.2445,...,1845.8577,2081.8398,0.0000,1005.5723,634.8503,847.9026,1113.4934,1890.4258,504.3626,1981.8208
Portland,2172.3091,2539.3973,2289.5077,1756.8598,2055.5284,1632.7538,976.3049,1948.4622,534.9639,1835.5434,...,2529.1158,2412.8864,1005.5723,0.0000,482.7207,1719.5300,144.1444,2113.0316,635.8410,2353.4139
Sacramento,2086.1141,2631.0563,2244.4277,1790.9991,2101.7189,1439.8514,882.8597,2006.9096,68.1920,1608.5232,...,2394.8246,2458.0298,634.8503,482.7207,0.0000,1457.7530,623.5480,2200.5169,533.1040,2377.3871
San Antonio,882.4412,1766.9534,1105.4190,1050.5431,1257.0025,251.5540,807.0737,1234.9548,1479.0023,189.7920,...,1037.2100,1505.1714,847.9026,1719.5300,1457.7530,0.0000,1786.0026,1441.1172,1086.7767,1386.8073
Seattle,2181.5838,2492.2631,2285.2923,1735.3692,2026.4251,1680.6166,1014.2248,1916.9430,677.6888,1890.4460,...,2549.5401,2380.5737,1113.4934,144.1444,623.5480,1786.0026,0.0000,2070.8813,700.3238,2327.9420
Toronto,735.9878,431.3524,588.1744,439.0717,191.3496,1205.7027,1349.9264,216.7456,2258.9598,1302.2439,...,1050.3194,339.7985,1890.4258,2113.0316,2200.5169,1441.1172,2070.8813,0.0000,1668.7240,352.7370
Utah,1583.1442,2098.7672,1727.2478,1258.0651,1568.7309,999.1334,365.0766,1473.8677,590.2752,1199.7346,...,1918.1523,1925.4344,504.3626,635.8410,533.1040,1086.7767,700.3238,1668.7240,0.0000,1846.3873
Washington,541.7573,394.9290,328.3485,597.4263,304.5719,1184.3888,1498.2042,417.3337,2430.3360,1218.9111,...,755.9546,121.7231,1981.8208,2353.4139,2377.3871,1386.8073,2327.9420,352.7370,1846.3873,0.0000

In [203]:
Nbadistances.values.diagonal(1).sum() # первая побочная диагональ — расстояние по всему маршруту

33365.658200000005

In [208]:
Nbadistances.iloc[-1, 0] # .loc['Washington', 'Atlanta'] обратный путь в Атланту

541.7573

В файле Matchtype1.xlsx перечислены суммы 30 сделок в хронологическом порядке. Напишите формулу для определения первой сделки, после которой общий объем сделок превысил 10 000 долларов.

In [209]:
matchtype = pd.read_excel('/Ch04/Practice Files/Matchtype1.xlsx',
                              skiprows=4, index_col=0)

In [215]:
matchtype[matchtype['Cumulative'] > 10000].head(1)

             Amount  Cumulative
Transaction
10             1344       10177

В файле Matchthemax.xlsx содержатся идентификационные коды продуктов и показатели продаж в штуках для 265 продуктов. С помощью формулы с функцией ПОИСКПОЗ определите идентификационный код продукта с наибольшим показателем продаж.

In [221]:
matchthemax = pd.read_excel('/Ch04/Practice Files/Matchthemax.xlsx',
                              skiprows=3, usecols=range(3), index_col=0)

In [225]:
matchthemax[matchthemax.Amount == matchthemax.Amount.max()]

            Product ID  Amount
Transaction
177                eqg    4979

В файле Buslist.xlsx содержатся интервалы времени (в минутах) между автобусами на пересечении 45-й улицы и Парк-авеню в Нью-Йорке. Напишите формулу расчета времени ожидания пассажиром автобуса для любого времени прихода пассажира на остановку (отсчет от первого автобуса). Например, если бы вы пришли на остановку, начиная с настоящего момента, через 12,4 минуты, а автобусы прибыли бы, начиная с настоящего момента, через 5 минут и через 21 минуту, вам пришлось бы ждать автобус 21 – 12,4 = 8,6 минуты.

In [246]:
buses = pd.read_excel('/Ch04/Practice Files/Buslist.xlsx',
                              skiprows=3, usecols=range(5,6))

In [249]:
buses.index = range(1, 20)
buses.index.name = 'Bus #'
buses['Arrival'] = buses['Times between buses'].cumsum()

In [250]:
buses

       Times between buses  Arrival
Bus #
1                     45.4     45.4
2                     18.6     64.0
3                     76.5    140.5
4                     88.6    229.1
5                     97.4    326.5
6                     23.1    349.6
7                     98.0    447.6
8                     33.7    481.3
9                      2.8    484.1
10                    37.0    521.1
11                    24.7    545.8
12                     6.9    552.7
13                    63.9    616.6
14                    84.0    700.6
15                     4.1    704.7
16                    81.4    786.1
17                    81.2    867.3
18                     1.2    868.5
19                    73.0    941.5

In [235]:
arrival_time = 400

In [251]:
(buses.query('Arrival > @arrival_time')['Arrival'] - arrival_time).head(1)

Bus #
7    47.6
Name: Arrival, dtype: float64

В ячейках B3:B6 файла Showbiz.xlsx содержатся фиктивные адреса некоторых известных людей. С помощью текстовых функций запишите имена в один столбец, а адрес в другой.

In [257]:
showbiz = pd.read_excel('/Ch05/Practice Files/Showbiz.xlsx',
                              skiprows=1, usecols=range(1,2), names=['text'])

In [284]:
showbiz.text.str.extract(r'(?P<name>.*)\s(?P<address>\d+.*)')

             name              address
0    Allie Mcbeal    1200 Lawyer Drive
1      Drew Carey  1000 Hollywood Lane
2  Britney Spears      300 Singer Road
3  Peyton Manning        500 QB Street

В файле Quarterlygnpdata.xlsx хранятся квартальные данные по валовому нацио- нальному продукту (GNP) США (в млрд долларов). Распределите эти данные по трем столбцам следующим образом: в первый столбец запишите год, во второй — номер квартала и в третий — GNP.

In [289]:
quarterlygnpdata = pd.read_excel('/Ch05/Practice Files/Quarterlygnpdata.xlsx',
                                 skiprows=7, names=['data'])

In [294]:
quarterlygnpdata.data.str.extract(r'(?P<year>\d{4}).(?P<quarter>\d)\s+(?P<GNP>[0-9.]+)')

     year quarter     GNP
0    1950       1  1618.4
1    1950       2  1667.2
2    1950       3  1733.1
3    1950       4  1763.9
4    1951       1  1782.9
..    ...     ...     ...
205  2001       2  9224.3
206  2001       3  9199.8
207  2001       4  9283.5
208  2002       1  9367.5
209  2002       2  9379.0

[210 rows x 3 columns]

В файле Textstylesdata.xlsx содержится информация о фасоне, цвете и размере различных рубашек. Например, первая рубашка имеет фасон 100 (указанный цифрами между двоеточием и дефисом), цвет 65 и размер L. С помощью текстовых функций распределите по столбцам фасон, цвет и размер для каждой рубашки.

In [299]:
styles = pd.read_excel('/Ch05/Practice Files/Textstylesdata.xlsx',
                        names=['item'])

In [301]:
styles.item.str.extract(r':(?P<style>\d{3})-(?P<color>\d{2})(?P<size>\w+)')

   style color size
0    100    65    L
1    100    65   XL
2    100    65  XXL
3    100    06    M
4    100    06    L
..   ...   ...  ...
59   125    01    S
60   125    01    M
61   125    01    L
62   125    01   XL
63   125    01  XXL

[64 rows x 3 columns]

В файле Emailproblem.xlsx даны имена и фамилии нескольких новых сотрудников Microsoft. Для создания адреса электронной почты каждого сотрудника возьмите первую букву имени сотрудника, затем фамилию сотрудника и в конце добавьте @microsoft.com. Рекомендуется создать адреса путем рационального использования текстовых функций.

In [312]:
emails = pd.read_excel('/Ch05/Practice Files/Emailproblem.xlsx',
                        skiprows=1, usecols=range(4,5), names=['name'])

In [315]:
emails['email'] = emails.name.apply(lambda x: f"{x[0]}{x.split()[-1]}{'@microsoft.com'}")

In [316]:
emails

                name                     email
0  Calista Flockhart  CFlockhart@microsoft.com
1     Peyton Manning    PManning@microsoft.com
2    Jessica Simpson    JSimpson@microsoft.com
3     Britney Spears     BSpears@microsoft.com
4       Vince Vaughn     VVaughn@microsoft.com
5        Owen Wilson     OWilson@microsoft.com
6      Dirk Nowitzki   DNowitzki@microsoft.com
7         Duane Wade       DWade@microsoft.com
8      Albert Puhols     APuhols@microsoft.com

В файле Reversenames.xlsx содержатся имена, вторые имена или инициалы и фамилии нескольких людей. Преобразуйте эти имена следующим образом: сначала фамилия, за ней запятая, а затем имя и второе имя. Например, преобразуйте Gregory William Winston в Winston, Gregory William.

In [321]:
reversenames = pd.read_excel('/Ch05/Practice Files/Reversenames.xlsx',
                             skiprows=3, usecols=range(1,2), names=['name'])

In [335]:
reversenames['combined'] = reversenames.name.str.replace('(?P<first>\w+) (?P<middle>[a-zA-Z.]+) (?P<last>\w+)',
                               lambda m: f"{m.group('last')}, {m.group('first')} {m.group('middle')}", regex=True)

In [336]:
reversenames

                      name                  combined
0  Gregory William Winston  Winston, Gregory William
1      Vivian June Winston      Winston, Vivian June
2     Wayne Leslie Winston     Winston, Wayne Leslie
3     Jennifer Mae Winston     Winston, Jennifer Mae
4        Jeff Jack Sagarin        Sagarin, Jeff Jack
5          Walter J. Gantz          Gantz, Walter J.
6          John F. Kennedy          Kennedy, John F.
7      George Herbert Bush      Bush, George Herbert
8    Richard Milhous Nixon    Nixon, Richard Milhous

В файле Incomefrequency.xlsx находится распределение стартовых зарплат выпускников MBA колледжа Faber College. Обобщите эти данные с помощью частотного графа.

In [344]:
incomefrequency = pd.read_excel('/Ch05/Practice Files/Incomefrequency.xlsx',
                             skiprows=1, usecols=range(3,5), names=['bin', 'income'])

In [352]:
incomefrequency.style.bar(subset=['income'], align='mid', color='#5fba7d')

В файле Ageofmachine.xlsx содержатся данные в следующей форме:
- S/N: 160768, vib roller, 84′′ smooth drum, canopy Auction: 6/2–4/2005 in Montgomery, Alabama;
- каждая строка связана с покупкой машины.
Определите год каждой покупки.

In [360]:
ageofmachine = pd.read_excel('/Ch05/Practice Files/Ageofmachine.xlsx',
                             skiprows=3, usecols=range(2,3), names=['desc']).dropna()

In [397]:
ageofmachine['year'] = ageofmachine['desc'].str.extract(r'Auction: \d{1,2}/[1-9-]+/(?P<year>\d{4})')

In [398]:
ageofmachine

                                                desc  year
0  S/N: 160768, vib roller,84" smooth drum,canopy...  2005
1  S/N: 160321, OROPS,dsl,84" drum Auction: 4/6-8...  2006
2  S/N: 156121, vib roller,Cummins dsl eng,OROPS ...  2004

В файле Problem17data.xlsx содержатся имена людей (например, Mr. John Doe). С помощью текстовых функций извлеките обращение (Mr. или Mrs.) и первое имя каждого человека и поместите их в отдельные столбцы.

In [41]:
mrs = pd.read_excel('~/Study/excel/Ch05/Practice Files/Problem17data.xlsx',
                    skiprows=1, usecols=[2], names=['names'])

In [42]:
mrs

              names
0      Mr. John Doe
1    Mrs. Wendy Liu
2     Ms. Juli Sipe
3  Mr. Jeff Sagarin
4  Mr. Alex Baldwin
5    Mr. James Dean
6      Ms. Cora Hsu

In [49]:
mrs.names.str.extract(r'(?P<title>M[rs].*\.)\s(?P<first_name>\w+)\s')

  title first_name
0   Mr.       John
1  Mrs.      Wendy
2   Ms.       Juli
3   Mr.       Jeff
4   Mr.       Alex
5   Mr.      James
6   Ms.       Cora

В файле Machinedates.xlsx содержатся даты покупки и продажи нескольких машин. Определите, сколько месяцев и лет хранились эти машины.

In [52]:
machinedates = pd.read_excel('~/Study/excel/Ch06/Practice Files/Machinedates.xlsx',
                    skiprows=2, usecols=range(3,7))

In [73]:
machinedates['Months kept'] = machinedates \
                        .apply(lambda df: (df['Sold'] - df['Bought']) / np.timedelta64(1, 'M'), axis=1).astype(int)

In [74]:
machinedates['Years kept'] = machinedates \
                        .apply(lambda df: (df['Sold'] - df['Bought']) / np.timedelta64(1, 'Y'), axis=1).astype(int)

In [75]:
machinedates

       Bought       Sold  Months kept  Years kept
0  2012-04-27 2013-08-22           15           1
1  2012-12-01 2014-09-04           21           1
2  2013-07-30 2015-05-13           21           1
3  2013-07-10 2015-03-15           20           1
4  2019-11-17 2022-07-22           32           2
5  2020-01-02 2023-07-03           41           3
6  2017-01-18 2021-02-03           48           4
7  2018-10-06 2022-01-07           39           3
8  2017-09-10 2019-09-23           24           2
9  2016-04-11 2020-02-10           45           3
10 2022-11-07 2023-10-08           11           0
11 2014-01-14 2016-12-21           35           2
12 2013-11-19 2016-07-16           31           2
13 2020-08-26 2024-05-09           44           3
14 2015-12-30 2016-11-07           10           0
15 2022-12-25 2027-01-08           48           4
16 2016-06-29 2019-08-17           37           3
17 2014-09-07 2016-10-31           25           2
18 2011-02-18 2011-12-26           10           0
19 2018-08-11 2021-08-17           36           3
20 2022-04-04 2024-07-14           27           2

В файле Addresses.xlsx имена людей указаны на одной строке, часть адреса с названием улицы на другой строке, а город, штат и почтовый индекс на следующей строке. Каким образом можно указать информацию о каждом человеке в одной строке?

In [99]:
addresses = pd.read_excel('~/Study/excel/Ch11/Practice Files/Addresses.xlsx',
                      skiprows=1, usecols=range(2,5)).rename(columns={'Unnamed: 2': 'address'})

In [128]:
addresses

                 address
0          Wayne Winston
1        3600 Winston St
2   Bloomington IN 47401
3           Jeff Sagarin
4         18 Tree Street
5      New York NY 10039
6              Juli Lipe
7    51 Springbrook Road
8    Livingston NJ 07039
9         Marilu Heppner
10       1212 1st Street
11     Chicago III 90210

In [127]:
addresses.groupby(addresses.index // 3).transform(lambda x: ' '.join(x)).drop_duplicates()

                                             address
0  Wayne Winston 3600 Winston St Bloomington IN 4...
3      Jeff Sagarin 18 Tree Street New York NY 10039
6  Juli Lipe 51 Springbrook Road Livingston NJ 07039
9   Marilu Heppner 1212 1st Street Chicago III 90210

В файле FormattingDDAnum.xlsx содержится несколько текстовых строк, таких как DDA, D, DDA1250045 и т. д. Ячейка является правильно отформатированной, если первыми тремя символами являются DDA, а последними семью символами — число не меньше миллиона. Определите, какие ячейки отформатированы должным образом.

In [141]:
dda = pd.read_excel('~/Study/excel/Ch11/Practice Files/FormattingDDAnum.xlsx',
                      skiprows=2, usecols=range(2,3), nrows=14, names=['id'])

In [151]:
dda

            id
0   DDA   :  D
1   DDA   : DD
2   DDA   :DDA
3   DDA  :DDA5
4   DDA  54389
5   DDA  54472
6   DDA  54508
7   DDA 543822
8   DDA 543898
9   DDA 546941
10  DDA:546830
11  DDA_PENDIN
12  DDA1225183
13  DDA1250045

In [159]:
import re
fmt = r'^DDA\d{6,}$'

In [161]:
dda.id.apply(lambda x: re.match(fmt, x) and re.match(fmt, x)[0] or 'INCORRECT')

0      INCORRECT
1      INCORRECT
2      INCORRECT
3      INCORRECT
4      INCORRECT
5      INCORRECT
6      INCORRECT
7      INCORRECT
8      INCORRECT
9      INCORRECT
10     INCORRECT
11     INCORRECT
12    DDA1225183
13    DDA1250045
Name: id, dtype: object

В файле Matchlist.xlsx содержится список покупателей, приобретших ваш продукт в феврале, и список покупателей, приобретших его в марте. Определите, сколько клиентов, купивших продукт в феврале, купили его и в марте.

In [162]:
matchlist = pd.read_excel('~/Study/excel/Ch11/Practice Files/Matchlist.xlsx',
                          skiprows=3, usecols=range(4,6))

In [172]:
np.intersect1d(matchlist['Feb'], matchlist['March'])

array(['Alex', 'Izzie', 'Mike'], dtype=object)